opensource-apple/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI.cpp
        USBLog(5,"AppleUSBOHCI[%p]::UIMInitialize errata bits=%lx", this, _errataBits);
		
        _pOHCIRegisters = (OHCIRegistersPtr) _deviceBase->getVirtualAddress();
		
#if (DEBUGGING_LEVEL > 2)
        dumpRegs();
#endif
        
        // enable the card
        lvalue = _device->configRead32(kIOPCIConfigCommand);
        _device->configWrite32(kIOPCIConfigCommand, (lvalue & 0xffff0000) | (kIOPCICommandBusMaster | kIOPCICommandMemorySpace));
		
        // Check to see if the hcDoneHead is not NULL.  If so, then we need to reset the controller
        //
        hcDoneHead = USBToHostLong(_pOHCIRegisters->hcDoneHead);
        if ( hcDoneHead != NULL )
        {
            USBError(1,"AppleUSBOHCI[%p]::UIMInitialize Non-NULL hcDoneHead: 0x%lx", this, hcDoneHead );
			
            // Reset it now
            //
            _pOHCIRegisters->hcCommandStatus = USBToHostLong(kOHCIHcCommandStatus_HCR);  // Reset OHCI
            IOSleep(3);
        }
        
        _pOHCIRegisters->hcControlCurrentED = 0;
        _pOHCIRegisters->hcControlHeadED = 0;
        IOSync();
		
        // Set up HCCA.
        _pHCCA = (Ptr) IOMallocContiguous(kHCCAsize, kHCCAalignment, &_hccaPhysAddr);
        if (!_pHCCA)
        {
            USBError(1,"AppleUSBOHCI[%p]::UIMInitialize Unable to allocate memory (2)", this);
            err = kIOReturnNoMemory;
            break;
        }
		
        OSWriteLittleInt32(&_pOHCIRegisters->hcHCCA, 0, _hccaPhysAddr);
        IOSync();
		
		// Set the HC to write the donehead to the HCCA, and enable interrupts
        _pOHCIRegisters->hcInterruptStatus = HostToUSBLong(kOHCIHcInterrupt_WDH);
        IOSync();
		
		// Enable the interrupt delivery.
		_workLoop->enableAllInterrupts();
		
        _rootHubFuncAddress = 1;
		
        // set up Interrupt transfer tree
        if ((err = IsochronousInitialize()))	break;
        if ((err = InterruptInitialize()))	break;
		if ((err = BulkInitialize()))		break;
        if ((err = ControlInitialize()))	break;
		
        // Set up hcFmInterval.
        UInt32	hcFSMPS;				// in register hcFmInterval
        UInt32	hcFI;					// in register hcFmInterval
        UInt32	hcPS;					// in register hcPeriodicStart
        
        hcFI = USBToHostLong(_pOHCIRegisters->hcFmInterval) & kOHCIHcFmInterval_FI;
        // this formula is from the OHCI spec, section 5.4
        hcFSMPS = ((((hcFI-kOHCIMax_OverHead) * 6)/7) << kOHCIHcFmInterval_FSMPSPhase);
        hcPS = (hcFI * 9) / 10;			// per spec- 90%
		_pOHCIRegisters->hcFmInterval = HostToUSBLong(hcFI | hcFSMPS);
        _pOHCIRegisters->hcPeriodicStart = HostToUSBLong(hcPS);
        IOSync();
		
		if (_errataBits & kErrataNECIncompleteWrite)
		{
			UInt32		newValue = 0, count = 0;
			// check hcFmInterval
			newValue = USBToHostLong(_pOHCIRegisters->hcFmInterval);
			while ((count++ < 10) && (newValue != (hcFI | hcFSMPS)))
			{
				USBError(1, "OHCI driver: UIMInitialize - hcFmInterval not sticking. Retrying.");
				_pOHCIRegisters->hcFmInterval = HostToUSBLong(hcFI | hcFSMPS);
				IOSync();
				newValue = USBToHostLong(_pOHCIRegisters->hcFmInterval);
			}
			count = 0;						// reset
			// check hcPeriodicStart
			newValue = USBToHostLong(_pOHCIRegisters->hcPeriodicStart);
			while ((count++ < 10) && (newValue != hcPS))
			{
				USBError(1, "OHCI driver: UIMInitialize - hcPeriodicStart not sticking. Retrying.");
				_pOHCIRegisters->hcPeriodicStart = HostToUSBLong(hcPS);
				IOSync();
				newValue = USBToHostLong(_pOHCIRegisters->hcPeriodicStart);
			}
			
		}
		
		
        // Work around the Philips part which does weird things when a device is plugged in at boot
        //
        if (_errataBits & kErrataNeedsPortPowerOff)
        {
            USBError(1, "AppleUSBOHCI[%p]::UIMInitialize error, turning off power to ports to clear", this);
            OHCIRootHubPower(0 /* kOff */);
            // No need to turn the power back on here, the reset does that anyway.
        }
        
        // Just so we all start from the same place, reset the OHCI.
        _pOHCIRegisters->hcControl = HostToUSBLong ((kOHCIFunctionalState_Reset << kOHCIHcControl_HCFSPhase));
        IOSync();
		
		// Set OHCI to operational state and enable processing of control list.
        _pOHCIRegisters->hcControl = HostToUSBLong ((kOHCIFunctionalState_Operational << kOHCIHcControl_HCFSPhase)
													| kOHCIHcControl_CLE | kOHCIHcControl_BLE
													| kOHCIHcControl_PLE | kOHCIHcControl_IE);
        IOSync();
		
        // Initialize the Root Hub registers
		if (_errataBits & kErrataDisableOvercurrent)
			_pOHCIRegisters->hcRhDescriptorA |= HostToUSBLong(kOHCIHcRhDescriptorA_NOCP);
		_pOHCIRegisters->hcRhStatus = HostToUSBLong(kOHCIHcRhStatus_OCIC | kOHCIHcRhStatus_DRWE); // should be SRWE which should be identical to DRWE
		IOSync();

		if (_errataBits & kErrataNECIncompleteWrite)
		{
			UInt32		newValue = 0, count = 0;
			newValue = USBToHostLong(_pOHCIRegisters->hcRhStatus);			// this bit SHOULD now be set
			while ((count++ < 10) && !(newValue & kOHCIHcRhStatus_DRWE))
			{
				USBError(1, "OHCI driver: UIMInitialize - DRWE bit not sticking. Retrying.");
				_pOHCIRegisters->hcRhStatus = HostToUSBLong(kOHCIHcRhStatus_OCIC | kOHCIHcRhStatus_DRWE);
				IOSync();
				newValue = USBToHostLong(_pOHCIRegisters->hcRhStatus);
			}
		}
		
		OHCIRootHubPower(1 /* kOn */);
		
		// enable interrupts
        _pOHCIRegisters->hcInterruptEnable = HostToUSBLong (kOHCIHcInterrupt_MIE | kOHCIDefaultInterrupts);
        IOSync();
        
        if (_errataBits & kErrataLSHSOpti)
            OptiLSHSFix();
		
        _uimInitialized = true;
        
        return(kIOReturnSuccess);
		
    } while (false);
	
    USBError(1, "AppleUSBOHCI[%p]::UIMInitialize error(%x)", this, err);
    UIMFinalize();
	
    if (_filterInterruptSource) 
    {
        _filterInterruptSource->release();
        _filterInterruptSource = NULL;
    }
	
    return(err);
}



IOReturn 
AppleUSBOHCI::UIMFinalize(void)
{
    USBLog (3, "AppleUSBOHCI[%p]::UIMFinalize @ %lx (%lx)(shutting down HW)",this, 
			(long)_deviceBase->getVirtualAddress(),
			_deviceBase->getPhysicalAddress());
	
