opensource-apple/IOUSBFamily/AppleUSBOHCI/Classes/AppleUSBOHCI.cpp
    return kIOReturnSuccess;
}


void
AppleUSBOHCI::free()
{
    // Free our locks
    //
    IOLockFree( _intLock );
    IOSimpleLockFree( _wdhLock );
    
    super::free();
}



IODMACommand*
AppleUSBOHCI::GetNewDMACommand()
{
	return IODMACommand::withSpecification(kIODMACommandOutputHost64, 32, PAGE_SIZE);
}



IOReturn
AppleUSBOHCI::CheckForEHCIController(IOService *provider)
{
	OSIterator				*siblings = NULL;
	OSIterator				*ehciList = NULL;
    mach_timespec_t			t;
    OSDictionary			*matching;
    IOService				*service;
    IORegistryEntry			*entry;
    bool					ehciPresent = false;
	const char *			myProviderLocation;
	const char *			ehciProviderLocation;
	int						myDeviceNum = 0, myFnNum = 0;
	int						ehciDeviceNum = 0, ehciFnNum = 0;
	AppleUSBEHCI *			testEHCI;
	int						checkListCount = 0;
    
    // Check my provide (_device) parent (a PCI bridge) children (sibling PCI functions)
    // to see if any of them is an EHCI controller - if so, wait for it..
    
	if (provider)
	{
		siblings = provider->getParentEntry(gIOServicePlane)->getChildIterator(gIOServicePlane);
		myProviderLocation = provider->getLocation();
		if (myProviderLocation)
		{
			super::ParsePCILocation(myProviderLocation, &myDeviceNum, &myFnNum);
		}
	}
	else
	{
		USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - NULL provider", this);
	}
	
	if( siblings ) 
	{
		while( (entry = OSDynamicCast(IORegistryEntry, siblings->getNextObject())))
		{
			UInt32			classCode;
			OSData			*obj = OSDynamicCast(OSData, entry->getProperty("class-code"));
			if (obj) 
			{
				classCode = *(UInt32 *)obj->getBytesNoCopy();
				if (classCode == 0x0c0320) 
				{
					ehciPresent = true;
					break;
				}
			}
		}
		siblings->release();
	}
	else
	{
		USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - NULL siblings", this);
	}
	

    if (ehciPresent) 
	{
        t.tv_sec = 5;
        t.tv_nsec = 0;
        USBLog(7, "AppleUSBOHCI[%p]::CheckForEHCIController calling waitForService for AppleUSBEHCI", this);
        service = waitForService( serviceMatching("AppleUSBEHCI"), &t );
		testEHCI = (AppleUSBEHCI*)service;
		while (testEHCI)
		{
			ehciProviderLocation = testEHCI->getParentEntry(gIOServicePlane)->getLocation();
			if (ehciProviderLocation)
			{
				super::ParsePCILocation(ehciProviderLocation, &ehciDeviceNum, &ehciFnNum);
			}
			if (myDeviceNum == ehciDeviceNum)
			{
				USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - ehciDeviceNum and myDeviceNum match (%d)", this, myDeviceNum);
				_ehciController = testEHCI;
				_ehciController->retain();
				USBLog(7, "AppleUSBOHCI[%p]::CheckForEHCIController got EHCI service %p", this, service);
				setProperty("Companion", "yes");
				break;
			}
			else
			{
				// we found an instance of EHCI, but it doesn't appear to be ours, so now I need to see how many there are in the system
				// and see if any of them matches
				USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - ehciDeviceNum(%d) and myDeviceNum(%d) do NOT match", this, ehciDeviceNum, myDeviceNum);
				if (ehciList)
				{
					testEHCI = (AppleUSBEHCI*)(ehciList->getNextObject());
					if (testEHCI)
					{
						USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - got AppleUSBEHCI[%p] from the list", this, testEHCI);
					}
				}
				else
				{
					testEHCI = NULL;
				}
				
				if (!testEHCI && (checkListCount++ < 2))
				{
					if (ehciList)
						ehciList->release();
						
					if (checkListCount == 2)
					{
						USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - waiting for 5 seconds", this);
						IOSleep(5000);				// wait 5 seconds the second time around
					}

					USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - getting an AppleUSBEHCI list", this);
					ehciList = getMatchingServices(serviceMatching("AppleUSBEHCI"));
					if (ehciList)
					{
						testEHCI = (AppleUSBEHCI*)(ehciList->getNextObject());
						if (testEHCI)
						{
							USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - got AppleUSBEHCI[%p] from the list", this, testEHCI);
						}
					}
				}
			}
		}
    }
	else
	{
		USBLog(2, "AppleUSBOHCI[%p]::CheckForEHCIController - EHCI controller not found in siblings", this);
	}
	if (ehciList)
		ehciList->release();
		
	return kIOReturnSuccess;
}